{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"padding": "same", "activity_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "dtype": "float32", "dilation_rate": [1, 1], "batch_input_shape": [null, 32, 32, 3], "name": "conv2d_1", "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"padding": "valid", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_2", "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"padding": "valid", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_3", "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"padding": "valid", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_4", "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.25, "trainable": true}}, {"class_name": "Conv2D", "config": {"padding": "same", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_5", "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"padding": "valid", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_6", "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"padding": "same", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_7", "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}, {"class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"padding": "valid", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_8", "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}, {"class_name": "Activation", "config": {"name": "activation_8", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.25, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "units": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "activation": "linear", "name": "dense_1", "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}, {"class_name": "Activation", "config": {"name": "activation_9", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "units": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "activation": "linear", "name": "dense_2", "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}, {"class_name": "Activation", "config": {"name": "activation_10", "activation": "softmax", "trainable": true}}], "keras_version": "2.0.5"}