{"keras_version": "2.0.5", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "batch_input_shape": [null, 32, 32, 3], "filters": 32, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "padding": "valid", "activation": "linear", "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "trainable": true, "padding": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.25}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "padding": "same", "activation": "linear", "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "padding": "valid", "activation": "linear", "name": "conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "trainable": true, "padding": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "activity_regularizer": null, "activation": "linear", "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "bias_regularizer": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "activity_regularizer": null, "activation": "linear", "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "bias_regularizer": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_6", "trainable": true}}]}