{"backend": "tensorflow", "keras_version": "2.0.5", "config": [{"config": {"filters": 32, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "batch_input_shape": [null, 32, 32, 3], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "dtype": "float32", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"filters": 32, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "strides": [1, 1], "padding": "valid", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_2"}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"filters": 64, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "strides": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_3"}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"filters": 64, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "strides": [1, 1], "padding": "valid", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_4"}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}, {"config": {"filters": 64, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "strides": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_5"}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "class_name": "Activation"}, {"config": {"filters": 64, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "strides": [1, 1], "padding": "valid", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_6"}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "class_name": "Activation"}, {"config": {"trainable": true, "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "units": 512, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "class_name": "Activation"}, {"config": {"trainable": true, "rate": 0.5, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "units": 10, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_8"}, "class_name": "Activation"}], "class_name": "Sequential"}