{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "filters": 32, "bias_constraint": null, "strides": [1, 1], "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 32, 32, 3], "padding": "same", "dilation_rate": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dtype": "float32"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "filters": 32, "bias_constraint": null, "strides": [1, 1], "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.25, "trainable": true}}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "filters": 64, "bias_constraint": null, "strides": [1, 1], "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "filters": 64, "bias_constraint": null, "strides": [1, 1], "name": "conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "filters": 64, "bias_constraint": null, "strides": [1, 1], "name": "conv2d_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "filters": 64, "bias_constraint": null, "strides": [1, 1], "name": "conv2d_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.25, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "units": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "units": 10, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "softmax"}}], "keras_version": "2.0.5"}