{"config": [{"config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_constraint": null, "filters": 32, "name": "conv2d_1", "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"filters": 32, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_2", "activation": "linear", "use_bias": true, "trainable": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"filters": 32, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_3", "activation": "linear", "use_bias": true, "trainable": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"filters": 32, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_4", "activation": "linear", "use_bias": true, "trainable": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"filters": 64, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_5", "activation": "linear", "use_bias": true, "trainable": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "class_name": "Activation"}, {"config": {"filters": 64, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_6", "activation": "linear", "use_bias": true, "trainable": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_2", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"units": 512, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_7"}, "class_name": "Activation"}, {"config": {"trainable": true, "rate": 0.5, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"units": 10, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_8"}, "class_name": "Activation"}], "backend": "tensorflow", "keras_version": "2.0.5", "class_name": "Sequential"}