{"backend": "tensorflow", "keras_version": "2.0.5", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "batch_input_shape": [null, 32, 32, 3], "name": "conv2d_1", "padding": "same", "activation": "linear", "filters": 32, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "name": "conv2d_2", "padding": "valid", "activation": "linear", "filters": 32, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "name": "conv2d_3", "padding": "valid", "activation": "linear", "filters": 32, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "name": "conv2d_4", "padding": "valid", "activation": "linear", "filters": 32, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.25, "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "name": "conv2d_5", "padding": "same", "activation": "linear", "filters": 64, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "name": "conv2d_6", "padding": "valid", "activation": "linear", "filters": 64, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "padding": "valid", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.25, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "units": 512, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "units": 10, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_8", "activation": "softmax", "trainable": true}}]}